# DBeam_BeginShttGet

## Description
Start shutter get routine

```pascal
PROCEDURE DBeam_BeginShttGet;
```

```python
def vs.DBeam_BeginShttGet():
    return None
```

## Examples
```pascal
DBeam_BeginShttGet;
```
```python
import vs

# Start shutter get routine.
vs.DBeam_BeginShttGet()
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight